TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_eam.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_eam__include
#define ti_devices_msp_peripherals_hw_eam__include

/* Filename: hw_eam.h */
/* Revised: 2025-09-11 15:56:01 */
/* Revision: 2b5f545717ba26bba18de7a2db1005762df3b518 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* EAM Registers
******************************************************************************/
#define EAM_EAM_REGS_OFS                         ((uint32_t)0x00000000U)


/** @addtogroup EAM_EAM_REGS
  @{
*/

typedef struct {
       uint32_t RESERVED0[1024];
  __IO uint32_t REVISION;                          /* !< (@ 0x00001000) IP revision id register */
       uint32_t RESERVED1[3];
  __IO uint32_t SECURITY_ERR_FLAG;                 /* !< (@ 0x00001010) Security error flag */
  __IO uint32_t SECURITY_ERR_CLR;                  /* !< (@ 0x00001014) Security error clear */
  __IO uint32_t SECURITY_ERR_MSTID;                /* !< (@ 0x00001018) Security error master id */
  __IO uint32_t SECURITY_ERR_ADDR;                 /* !< (@ 0x0000101C) Security error address */
       uint32_t RESERVED2[4];
  __IO uint32_t FRI_SEC_FLAG;                      /* !< (@ 0x00001030) FRI SEC flag */
  __IO uint32_t FRI_SEC_CLR;                       /* !< (@ 0x00001034) FRI SEC clear */
  __IO uint32_t FRI_SEC_ADDR;                      /* !< (@ 0x00001038) FRI SEC address */
  __IO uint32_t FRI_SEC_MSTID;                     /* !< (@ 0x0000103C) FRI SEC master id */
       uint32_t RESERVED3[4];
  __IO uint32_t FRI_DED_FLAG;                      /* !< (@ 0x00001050) FRI DED flag */
  __IO uint32_t FRI_DED_CLR;                       /* !< (@ 0x00001054) FRI DED clear */
  __IO uint32_t FRI_DED_ADDR;                      /* !< (@ 0x00001058) FRI DED address */
  __IO uint32_t FRI_DED_MSTID;                     /* !< (@ 0x0000105C) FRI DED master id */
       uint32_t RESERVED4[4];
  __IO uint32_t SYSMEM_SEC_FLAG;                   /* !< (@ 0x00001070) SYSMEM SEC flag */
  __IO uint32_t SYSMEM_SEC_CLR;                    /* !< (@ 0x00001074) SYSMEM SEC clear */
  __IO uint32_t SYSMEM_SEC_ADDR;                   /* !< (@ 0x00001078) SYSMEM SEC address */
  __IO uint32_t SYSMEM_SEC_MSTID;                  /* !< (@ 0x0000107C) SYSMEM SEC master id */
       uint32_t RESERVED5[4];
  __IO uint32_t SYSMEM_DED_FLAG;                   /* !< (@ 0x00001090) SYSMEM DED flag */
  __IO uint32_t SYSMEM_DED_CLR;                    /* !< (@ 0x00001094) SYSMEM DED clear */
  __IO uint32_t SYSMEM_DED_ADDR;                   /* !< (@ 0x00001098) SYSMEM DED address */
  __IO uint32_t SYSMEM_DED_MSTID;                  /* !< (@ 0x0000109C) SYSMEM DED master id */
} EAM_EAM_REGS_Regs;

/*@}*/ /* end of group EAM_EAM_REGS */

/** @addtogroup EAM
  @{
*/

typedef struct {
  EAM_EAM_REGS_Regs  EAM_REGS;                          /* !< (@ 0x00000000) */
} EAM_Regs;

/*@}*/ /* end of group EAM */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* EAM Register Control Bits
******************************************************************************/

/* EAM_REVISION Bits */
/* EAM_REVISION[REVISION] Bits */
#define EAM_REVISION_REVISION_OFS                (0)                             /* !< REVISION Offset */
#define EAM_REVISION_REVISION_MASK               ((uint32_t)0x00000001U)         /* !< Revisoin register */

/* EAM_SECURITY_ERR_FLAG Bits */
/* EAM_SECURITY_ERR_FLAG[SECURE] Bits */
#define EAM_SECURITY_ERR_FLAG_SECURE_OFS         (0)                             /* !< SECURE Offset */
#define EAM_SECURITY_ERR_FLAG_SECURE_MASK        ((uint32_t)0x00000001U)         /* !< Secure error flag */
/* EAM_SECURITY_ERR_FLAG[PRIV] Bits */
#define EAM_SECURITY_ERR_FLAG_PRIV_OFS           (1)                             /* !< PRIV Offset */
#define EAM_SECURITY_ERR_FLAG_PRIV_MASK          ((uint32_t)0x00000002U)         /* !< Privilege error flag */
/* EAM_SECURITY_ERR_FLAG[HDP] Bits */
#define EAM_SECURITY_ERR_FLAG_HDP_OFS            (2)                             /* !< HDP Offset */
#define EAM_SECURITY_ERR_FLAG_HDP_MASK           ((uint32_t)0x00000004U)         /* !< Hide protection error flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLADDR] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLADDR_OFS    (3)                             /* !< FPI_ILLADDR Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLADDR_MASK   ((uint32_t)0x00000008U)         /* !< FPI ILLADDR flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLPROG] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLPROG_OFS    (4)                             /* !< FPI_ILLPROG Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLPROG_MASK   ((uint32_t)0x00000010U)         /* !< FPI ILLPROG flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLERASE] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLERASE_OFS   (5)                             /* !< FPI_ILLERASE Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLERASE_MASK  ((uint32_t)0x00000020U)         /* !< FPI ILLERASE flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLRDVER] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLRDVER_OFS   (6)                             /* !< FPI_ILLRDVER Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLRDVER_MASK  ((uint32_t)0x00000040U)         /* !< FPI ILLRDVER flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLMODECH] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLMODECH_OFS  (7)                             /* !< FPI_ILLMODECH Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLMODECH_MASK ((uint32_t)0x00000080U)         /* !< FPI ILLMODECH flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLCMD] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLCMD_OFS     (8)                             /* !< FPI_ILLCMD Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLCMD_MASK    ((uint32_t)0x00000100U)         /* !< FPI ILLCMD flag */
/* EAM_SECURITY_ERR_FLAG[FPI_ILLSIZE] Bits */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLSIZE_OFS    (9)                             /* !< FPI_ILLSIZE Offset */
#define EAM_SECURITY_ERR_FLAG_FPI_ILLSIZE_MASK   ((uint32_t)0x00000200U)         /* !< FPI ILLSIZE flag */
/* EAM_SECURITY_ERR_FLAG[FLC_MMR_ACCESS_ERROR] Bits */
#define EAM_SECURITY_ERR_FLAG_FLC_MMR_ACCESS_ERROR_OFS (10)                            /* !< FLC_MMR_ACCESS_ERROR Offset */
#define EAM_SECURITY_ERR_FLAG_FLC_MMR_ACCESS_ERROR_MASK ((uint32_t)0x00000400U)         /* !< FLC MMR ACCESS ERROR flag */
/* EAM_SECURITY_ERR_FLAG[FLSEM_ACCESS_ERROR] Bits */
#define EAM_SECURITY_ERR_FLAG_FLSEM_ACCESS_ERROR_OFS (11)                            /* !< FLSEM_ACCESS_ERROR Offset */
#define EAM_SECURITY_ERR_FLAG_FLSEM_ACCESS_ERROR_MASK ((uint32_t)0x00000800U)         /* !< FLSEM ACCESS ERROR flag */

