TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_eam.h
/* EAM_SECURITY_ERR_CLR Bits */
/* EAM_SECURITY_ERR_CLR[SECURE] Bits */
#define EAM_SECURITY_ERR_CLR_SECURE_OFS          (0)                             /* !< SECURE Offset */
#define EAM_SECURITY_ERR_CLR_SECURE_MASK         ((uint32_t)0x00000001U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[SEC] register. */
/* EAM_SECURITY_ERR_CLR[PRIV] Bits */
#define EAM_SECURITY_ERR_CLR_PRIV_OFS            (1)                             /* !< PRIV Offset */
#define EAM_SECURITY_ERR_CLR_PRIV_MASK           ((uint32_t)0x00000002U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[PRIV] register. */
/* EAM_SECURITY_ERR_CLR[HDP] Bits */
#define EAM_SECURITY_ERR_CLR_HDP_OFS             (2)                             /* !< HDP Offset */
#define EAM_SECURITY_ERR_CLR_HDP_MASK            ((uint32_t)0x00000004U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[HDP] register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLADDR] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLADDR_OFS     (3)                             /* !< FPI_ILLADDR Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLADDR_MASK    ((uint32_t)0x00000008U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLADDR]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLPROG] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLPROG_OFS     (4)                             /* !< FPI_ILLPROG Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLPROG_MASK    ((uint32_t)0x00000010U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLPROG]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLERASE] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLERASE_OFS    (5)                             /* !< FPI_ILLERASE Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLERASE_MASK   ((uint32_t)0x00000020U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLERASE]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLRDVER] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLRDVER_OFS    (6)                             /* !< FPI_ILLRDVER Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLRDVER_MASK   ((uint32_t)0x00000040U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLRDVER]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLMODECH] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLMODECH_OFS   (7)                             /* !< FPI_ILLMODECH Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLMODECH_MASK  ((uint32_t)0x00000080U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLMODECH]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLCMD] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLCMD_OFS      (8)                             /* !< FPI_ILLCMD Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLCMD_MASK     ((uint32_t)0x00000100U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLCMD]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FPI_ILLSIZE] Bits */
#define EAM_SECURITY_ERR_CLR_FPI_ILLSIZE_OFS     (9)                             /* !< FPI_ILLSIZE Offset */
#define EAM_SECURITY_ERR_CLR_FPI_ILLSIZE_MASK    ((uint32_t)0x00000200U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FPI_ILLSIZE]
                                                                                    register. */
/* EAM_SECURITY_ERR_CLR[FLC_MMR_ACCESS_ERROR] Bits */
#define EAM_SECURITY_ERR_CLR_FLC_MMR_ACCESS_ERROR_OFS (10)                            /* !< FLC_MMR_ACCESS_ERROR Offset */
#define EAM_SECURITY_ERR_CLR_FLC_MMR_ACCESS_ERROR_MASK ((uint32_t)0x00000400U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FLC_MMR_ACCESS
                                                                                    _ERROR] register. */
/* EAM_SECURITY_ERR_CLR[FLSEM_ACCESS_ERROR] Bits */
#define EAM_SECURITY_ERR_CLR_FLSEM_ACCESS_ERROR_OFS (11)                            /* !< FLSEM_ACCESS_ERROR Offset */
#define EAM_SECURITY_ERR_CLR_FLSEM_ACCESS_ERROR_MASK ((uint32_t)0x00000800U)         /* !< writing '1' will clear
                                                                                    SECURITY_ERR_FLAG[FLSEM_ACCESS_ERROR]
                                                                                    register. */

/* EAM_SECURITY_ERR_MSTID Bits */
/* EAM_SECURITY_ERR_MSTID[MSTID] Bits */
#define EAM_SECURITY_ERR_MSTID_MSTID_OFS         (0)                             /* !< MSTID Offset */
#define EAM_SECURITY_ERR_MSTID_MSTID_MASK        ((uint32_t)0x000000FFU)         /* !< Security error master ID. This
                                                                                    field will be cleared along with the
                                                                                    corresponding flag clear. */

/* EAM_SECURITY_ERR_ADDR Bits */
/* EAM_SECURITY_ERR_ADDR[ADDRESS] Bits */
#define EAM_SECURITY_ERR_ADDR_ADDRESS_OFS        (0)                             /* !< ADDRESS Offset */
#define EAM_SECURITY_ERR_ADDR_ADDRESS_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Security error address. This field
                                                                                    will be cleared along with the
                                                                                    corresponding flag clear. */

/* EAM_FRI_SEC_FLAG Bits */
/* EAM_FRI_SEC_FLAG[SEC] Bits */
#define EAM_FRI_SEC_FLAG_SEC_OFS                 (0)                             /* !< SEC Offset */
#define EAM_FRI_SEC_FLAG_SEC_MASK                ((uint32_t)0x00000001U)         /* !< Single error correction error */

/* EAM_FRI_SEC_CLR Bits */
/* EAM_FRI_SEC_CLR[SEC] Bits */
#define EAM_FRI_SEC_CLR_SEC_OFS                  (0)                             /* !< SEC Offset */
#define EAM_FRI_SEC_CLR_SEC_MASK                 ((uint32_t)0x00000001U)         /* !< writing '1' will clear
                                                                                    FRI_SEC_FLAG[SEC] register. */

/* EAM_FRI_SEC_ADDR Bits */
/* EAM_FRI_SEC_ADDR[ADDRESS] Bits */
#define EAM_FRI_SEC_ADDR_ADDRESS_OFS             (0)                             /* !< ADDRESS Offset */
#define EAM_FRI_SEC_ADDR_ADDRESS_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Single error correction error
                                                                                    address. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_FRI_SEC_MSTID Bits */
/* EAM_FRI_SEC_MSTID[MSTID] Bits */
#define EAM_FRI_SEC_MSTID_MSTID_OFS              (0)                             /* !< MSTID Offset */
#define EAM_FRI_SEC_MSTID_MSTID_MASK             ((uint32_t)0x000000FFU)         /* !< Single error correction error
                                                                                    master ID. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_FRI_DED_FLAG Bits */
/* EAM_FRI_DED_FLAG[DED] Bits */
#define EAM_FRI_DED_FLAG_DED_OFS                 (0)                             /* !< DED Offset */
#define EAM_FRI_DED_FLAG_DED_MASK                ((uint32_t)0x00000001U)         /* !< Double error detect error */
/* EAM_FRI_DED_FLAG[DIAG_DED] Bits */
#define EAM_FRI_DED_FLAG_DIAG_DED_OFS            (1)                             /* !< DIAG_DED Offset */
#define EAM_FRI_DED_FLAG_DIAG_DED_MASK           ((uint32_t)0x00000002U)         /* !< diagnostic Double error detect
                                                                                    error */

